Revit 2027 API
TriangleInShellComponent.VertexIndex1 Property
 Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int VertexIndex1 { get; }
Public ReadOnly Property VertexIndex1 As Integer
	Get
public:
property int VertexIndex1 {
	int get ();
}
member VertexIndex1 : int with get
Property Value
Int32
See Also
Reference
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace